{
  "Header": {
    "lang": "en",
    "subtitle": "Frontend-developer",
    "title": "Евгений Мазуров"
  },
  "Index": {
    "education": "Образование",
    "experience": "Опыт работы"
  },
  "Metadata": {
    "title": "Евгений Мазуров | Frontend-developer"
  },
  "Work": {
    "crtweb": {
      "achievements": "",
      "company": "crtweb",
      "role": "Frontend-разработчик",
      "state": "Тюмень"
    },
    "currentTime": "по текущее время",
    "ozon": {
      "achievements": "<list><item>Сократил время выкатки приложения на 65% за счет оптимизации сборки и конфигурации CI/CD, что ускорило выкатку с 20 минут до 7;</item><item>Настроил плавную миграцию проекта с ванильного JS на TypeScript с автоматическим созданием типов из схем GraphQL, что позволило решать технический долг плавно без ущерба для бизнеса;</item><item>Внедрил функционал развертывания A/B-тестирования на основе внутреннего B/G функционала;</item><item>Написал внутренний node.js-сервер для отдачи микроразметки внутренних ссылок CRM, дополнительно написал генератор gRPC-клиента на TypeScript, автоматически загружающий все необходимые зависимости protobuf (как открытые, так и доступные только сотрудникам).</item></list>",
      "company": "Озон",
      "role": "Разработчик информационных систем",
      "state": "Москва"
    },
    "uula": {
      "achievements": "<list><item>Разработка велась для арабоязычных стран, была полная поддержка верстки под обычные и арабоязычные (справа налево, rtl) интерфейсы;</item><item>Декомпозировал, описывал и оценивал задачи для frontend-команды, распределял задачи среди разработчиков и отслеживал их выполнение;</item><item>Полностью переработал внутренний DRM-видеоплеер, одну из важнейших фич на платформе. За счет этого сильно выросла поддерживаемость плеера, к примеру последующий редизайн плеера был завершен за две недели вместо шести, что сэкономило команде месяц работы;</item><item>Курировал разработку читалки PDF-файлов. Благодаря использованию макротасок и виртуализации для улучшения UX работы пользователя с учебными пособиями (> 100–200 страниц) было уменьшено время рендеринга файлов с 3 до 0,4 с и поиска по тексты с 2 до 0,1 с;</item><item>Был лидом команды по техническому долгу платформы. В рамках работы команды: <list><item>Исправил проблемы безопасности CSP в Next.js и написал строго типизированную маршрутизацию, что повысило надежность при разработке фич;</item><item>Консультировал функциональные группы при сложностях с продвинутыми функциями TypeScript'а и React'а, а также проектированию кода;</item><item>Полностью переработал словари переводов i18n для оптимизации размера сборки приложения а также плавного расширения приложения в других странах.</item></list></item></list>",
      "company": "UULA Technologies",
      "role": "Senior Frontend-developer",
      "state": "Кувейт"
    },
    "yandex": {
      "achievements": "<list><item>Инициировал и разработал решение для автоматического ведения документации по аналитике событий пользователя с использованием Typescript AST, что позволило сократить время ежемесячной поддержки документации с одного-двух дней в месяц до нескольких секунд;</item><item>Полностью разработал новые страницы и разделы внутри ЛК;</item><item>Внедрил и отвечал за работу внутреннего эквайрингового виджета в ЛК.</item></list>",
      "company": "Яндекс",
      "role": "Разработчик интерфейсов",
      "state": "Москва"
    }
  }
}